; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v7 ?v1)
		(pred_3 ?v6)
		(pred_2 ?v4)
		(pred_1 ?v4)
		(pred_5 ?v6 ?v4)
		(pred_4)
		(pred_6 ?v6))

   (:action op_3
       :parameters  (?v8 ?v2)
       :precondition (and (not-eq ?v8 ?v2) 
                          (pred_2 ?v8) (pred_2 ?v2) (pred_1 ?v8))
       :effect (and  (pred_1 ?v2)
		     (not (pred_1 ?v8))))


   (:action op_1
       :parameters (?v3 ?v5)
       :precondition  (and  (pred_3 ?v3) (pred_2 ?v5)
			    (pred_5 ?v3 ?v5) (pred_1 ?v5) (pred_4))
       :effect (and (pred_6 ?v3)
		    (not (pred_5 ?v3 ?v5)) 
		    (not (pred_4))))

   (:action op_2
       :parameters  (?v3  ?v5)
       :precondition  (and  (pred_3 ?v3) (pred_2 ?v5)
			    (pred_6 ?v3) (pred_1 ?v5))
       :effect (and (pred_5 ?v3 ?v5)
		    (pred_4)
		    (not (pred_6 ?v3)))))

; problem
(define (problem ferry-l3-c2)
(:domain ferry)
(:objects obj_01 obj_03 obj_04 
          obj_05 obj_02 
)
(:init
(pred_2 obj_01)
(pred_2 obj_03)
(pred_2 obj_04)
(pred_3 obj_05)
(pred_3 obj_02)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_03)
(pred_4)
(pred_5 obj_05 obj_01)
(pred_5 obj_02 obj_01)
(pred_1 obj_01)
)
(:goal
(and
(pred_5 obj_05 obj_01)
(pred_5 obj_02 obj_04)
)
)

(:constraints
  (sometime-before  (pred_5 obj_02 obj_04) (pred_1 obj_03))
)
)

; plan
1. (op_1 obj_05 obj_01)
   deleted: (pred_5 obj_05 obj_01) (pred_4)
   added: (pred_6 obj_05)
   goals met: 0 of 2
2. (op_3 obj_01 obj_03)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_03)
   goals met: 0 of 2
3. (op_2 obj_05 obj_03)
   deleted: (pred_6 obj_05)
   added: (pred_5 obj_05 obj_03) (pred_4)
   goals met: 0 of 2
4. (op_3 obj_03 obj_01)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_01)
   goals met: 0 of 2
5. (op_1 obj_02 obj_01)
   deleted: (pred_5 obj_02 obj_01) (pred_4)
   added: (pred_6 obj_02)
   goals met: 0 of 2
6. (op_3 obj_01 obj_04)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_04)
   goals met: 0 of 2
7. (op_2 obj_02 obj_04)
   deleted: (pred_6 obj_02)
   added: (pred_5 obj_02 obj_04) (pred_4)
   goals met: 1 of 2
8. (op_3 obj_04 obj_03)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_03)
   goals met: 1 of 2
9. (op_1 obj_05 obj_03)
   deleted: (pred_5 obj_05 obj_03) (pred_4)
   added: (pred_6 obj_05)
   goals met: 1 of 2
10. (op_3 obj_03 obj_01)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_01)
   goals met: 1 of 2
11. (op_2 obj_05 obj_01)
   deleted: (pred_6 obj_05)
   added: (pred_5 obj_05 obj_01) (pred_4)
   goals met: 2 of 2
